* Increase star name length
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database extrasolar
:END:

** Hmm... it turns out that 25 characters isn't enough room to store a star's complete name. For instance, the star "Epsilon Trianguli Australis A" requires 30 characters. Modify the column so that it allows star names as long as 50 characters.

Oops... I forgot to include the name column when creating the table. Creating it here:
#+BEGIN_SRC sql
  ALTER TABLE stars
    ADD COLUMN name varchar(25) UNIQUE NOT NULL;
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|

Now implementing the assignment:
#+BEGIN_SRC sql
  ALTER TABLE stars
    ALTER COLUMN name TYPE varchar(50);
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|

Further Exploration
Assume the stars table already contains one or more rows of data. What will happen when you try to run the above command? To test this, revert the modification and add a row or two of data:

#+BEGIN_SRC sql
  ALTER TABLE stars
  ALTER COLUMN name TYPE varchar(25);

  INSERT INTO stars (name, distance, spectral_type, companions)
             VALUES ('Alpha Centauri B', 4, 'K', 3);

  ALTER TABLE stars
  ALTER COLUMN name TYPE varchar(50);
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|
| INSERT 0 1  |
| ALTER TABLE |

